#+TITLE: Álgebra III
#+SUBTITLE: Ejercicios
#+AUTHOR: Mario Román
#+OPTIONS: toc:nil num:nil
#+LANGUAGE: es

#+LaTeX: \setcounter{secnumdepth}{0}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage{tikz-cd}
#+latex_header: \newtheorem{theorem}{Teorema}
#+latex_header: \newtheorem{fact}{Proposición}
#+latex_header: \newtheorem{definition}{Definición}
#+latex_header: \setlength{\parindent}{0pt}

** Ejercicio 2.16
Tenemos una extensión sobre $\mathbb{F}_2$ generada por un polinomio de grado 3. 
Sus elementos son clases de equivalencia sobre polinomios de hasta 
grado dos, habiendo 8 elementos. Abusando de la notación, los escribimos como
los representantes de su clase de equivalencia:

\[\{0,1,x,x+1,x^2,x^2+1,x^2+x,x^2+x+1\}\]

Tenemos las siguientes tablas para la suma y el producto:

#+BEGIN_SRC sage :exports none
R.<t> = PolynomialRing(GF(2),'t')
I = R.ideal(t^3+t+1)
S.<x> = R.quotient_ring(I)
#+END_SRC
#+RESULTS:

#+BEGIN_SRC sage :exports results
S.addition_table(
    names=["0","1","x","x+1","x^2","x^2+1","x^2+x","x^2+x+1"],
    elements=[0,1,x,x+1,x^2,x^2+1,x^2+x,x^2+x+1]
)
#+END_SRC
#+RESULTS:
#+begin_example

      +        0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
       +----------------------------------------------------------------
      0|       0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
      1|       1       0     x+1       x   x^2+1     x^2 x^2+x+1   x^2+x
      x|       x     x+1       0       1   x^2+x x^2+x+1     x^2   x^2+1
    x+1|     x+1       x       1       0 x^2+x+1   x^2+x   x^2+1     x^2
    x^2|     x^2   x^2+1   x^2+x x^2+x+1       0       1       x     x+1
  x^2+1|   x^2+1     x^2 x^2+x+1   x^2+x       1       0     x+1       x
  x^2+x|   x^2+x x^2+x+1     x^2   x^2+1       x     x+1       0       1
x^2+x+1| x^2+x+1   x^2+x   x^2+1     x^2     x+1       x       1       0
#+end_example

#+BEGIN_SRC sage :exports results
S.multiplication_table(
    names=["0","1","x","x+1","x^2","x^2+1","x^2+x","x^2+x+1"],
    elements=[0,1,x,x+1,x^2,x^2+1,x^2+x,x^2+x+1]
)
#+END_SRC
#+RESULTS:
#+begin_example

      *        0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
       +----------------------------------------------------------------
      0|       0       0       0       0       0       0       0       0
      1|       0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
      x|       0       x     x^2   x^2+x     x+1       1 x^2+x+1   x^2+1
    x+1|       0     x+1   x^2+x   x^2+1 x^2+x+1     x^2       1       x
    x^2|       0     x^2     x+1 x^2+x+1   x^2+x       x   x^2+1       1
  x^2+1|       0   x^2+1       1     x^2       x x^2+x+1     x+1   x^2+x
  x^2+x|       0   x^2+x x^2+x+1       1   x^2+1     x+1       x     x^2
x^2+x+1|       0 x^2+x+1   x^2+1       x       1   x^2+x     x^2     x+1
#+end_example

